package ch1;

public class ObjectCh1 {

	public static void main(String[] args) {
		/*
		 * Chapter1. 객체와 객체지향 프로그래밍
		 * 
		 * 객체(Ojbect)
		 * - 의사나 행위가 미치는 대상(사전적 의미)
		 * - 구체적, 추상적 데이터의 단위(학생, 회원, 생산, 주문, 배송)
		 * 
		 * 객체 지향 프로그램과 절차 지향 프로그래밍
		 * - 절차 지향 프로그래밍 : 시간이나 사건의 흐름에 따른 프로그래밍 (대표적인 언어 : C언어)
		 * : 일어난다 > 씻는다 > 밥을 먹는다 > 버스를 탄다 > 요금을 지불한다 > 학교에 도착
		 * 
		 * - 객체 지향 프로그래밍 : 학생, 밥, 버스, 학교
		 * : 관계들이 형성되는, 관계를 가지고 프로그래밍 하는 것(대표적인 언어 : C++, C#, Python, Javascript)
		 * 
		 * 객체 지향 프로그램은 어떻게 구현하는가?
		 * - 객체를 정의
		 * - 각 객체 제공하는 기능들을 구현
		 * - 각 객체가 제공하는 기능들 간의 소통(메시지 전달)을 통하여 객체간의 협력을 구현
		 */

	}

}
